package gz

import (
	"fmt"
	"testing"
)

/*
2033-1-5 9 壬子-癸丑-丙辰-癸巳
2033-2-3 20 癸丑-甲寅-乙酉-丙戌
2033-3-5 14 癸丑-乙卯-乙卯-癸未
2033-4-4 19 癸丑-丙辰-乙酉-丙戌
2033-5-5 12 癸丑-丁巳-丙辰-甲午
2033-6-5 16 癸丑-戊午-丁亥-戊申
2033-7-7 2 癸丑-己未-己未-乙丑
2033-8-7 12 癸丑-庚申-庚寅-壬午
2033-9-7 15 癸丑-辛酉-辛酉-丙申
2033-9-23 0 癸丑-辛酉-丁丑-庚子
2033-10-23 10 癸丑-壬戌-丁未-乙巳
2033-11-22 8 癸丑-癸亥-丁丑-甲辰
2033-12-7 3 癸丑-甲子-壬辰-壬寅
---
2033-1-5 8 壬子-壬子-丙辰-壬辰
2033-2-3 19 壬子-癸丑-乙酉-丙戌
2033-3-5 13 癸丑-甲寅-乙卯-癸未
2033-4-4 18 癸丑-乙卯-乙酉-乙酉
2033-5-5 11 癸丑-丙辰-丙辰-甲午
2033-6-5 15 癸丑-丁巳-丁亥-戊申
2033-7-7 1 癸丑-戊午-己未-乙丑
2033-8-7 11 癸丑-己未-庚寅-壬午
2033-9-7 14 癸丑-庚申-辛酉-乙未
2033-9-22 0 癸丑-辛酉-丙子-戊子
2033-10-23 9 癸丑-壬戌-丁未-乙巳
2033-11-22 7 癸丑-癸亥-丁丑-甲辰
2033-12-7 2 癸丑-癸亥-壬辰-辛丑
*/
func TestNewTGanZhi(t *testing.T) {
	y2033 := []struct {
		m, d, h, min, sec, nas int
	}{
		{01, 5, 9, 7, 39, 0},
		{2, 3, 20, 41, 8, 0},
		{3, 5, 14, 31, 54, 0},
		{4, 4, 19, 07, 41, 0},
		{5, 5, 12, 13, 18, 0},
		{6, 5, 16, 12, 58, 0},
		{7, 7, 2, 24, 29, 0},
		{8, 7, 12, 15, 17, 0},
		{9, 7, 15, 19, 53, 0},
		{9, 23, 0, 51, 12, 0},
		{10, 23, 10, 27, 8, 0},
		{11, 22, 8, 15, 42, 0},
		{12, 7, 3, 44, 27, 0},
	}
	year := 2033
	for i := 0; i < len(y2033); i++ {
		ts := y2033[i]
		h := ts.h - 1
		d := ts.d
		if h <= 0 {
			h = 0
			d -= 1
		}
		gzo := NewTGanZhi(year, ts.m, d, h)
		fmt.Printf("%d-%d-%d %d %s-%s-%s-%s\n", year, ts.m, d, h, gzo.Ygz, gzo.Mgz, gzo.Dgz, gzo.Hgz)
	}

}

/*
2033-02-03 20:41:08.072283267 +0800 CST
[2033-01-05 09:07:39.486383199 +0800 CST 2033-02-03 20:41:08.072283267 +0800 CST 2033-03-05 14:31:53.229587674 +0800 CST 2033-04-04 19:07:40.007026791 +0800 CST 2033-05-05 12:13:18.523530364 +0800 CST 2033-06-05 16:12:58.406707942 +0800 CST 2033-07-07 02:24:29.122762978 +0800 CST 2033-08-07 12:15:16.943407058 +0800 CST 2033-09-07 15:19:53.327705562 +0800 CST 2033-10-08 07:13:27.905119657 +0800 CST 2033-11-07 10:40:36.621531844 +0800 CST 2033-12-07 03:44:27.673842608 +0800 CST]

[2032-12-21 15:55:29.44856733 +0800 CST 2033-01-20 02:32:20.356376767 +0800 CST 2033-02-18 16:33:21.335982978 +0800 CST 2033-03-20 15:22:16.289714276 +0800 CST 2033-04-20 02:12:40.080179572 +0800 CST 2033-05-21 01:10:30.688458681 +0800 CST 2033-06-21 09:00:40.148927271 +0800 CST 2033-07-22 19:52:20.694437921 +0800 CST 2033-08-23 03:01:22.255035638 +0800 CST 2033-09-23 00:51:11.979917585 +0800 CST 2033-10-23 10:27:08.055931627 +0800 CST 2033-11-22 08:15:41.746826469 +0800 CST 2033-12-21 21:45:31.179110705 +0800 CST]
*/
func TestTMonthGanZhi(t *testing.T) {

	year, month, day, hour := 2022, 2, 4, 4 //2022 2 4 4H 壬寅年 月干支:壬寅
	year, month, day, hour = 2022, 2, 4, 3

	//year, month, day, hour = 2033, 12, 7, 3
	//year, month, day, hour = 2033, 1, 5, 8
	//year, month, day, hour = 2033, 1, 5, 9

	//year, month, day, hour = 2033, 2, 3, 19 //2033-2-3 19H  壬年 月干支:癸丑
	//year, month, day, hour = 2033, 2, 3, 20// 2033-2-3 20H  癸年 月干支:甲寅

	//year, month, day, hour = 2033, 3, 5, 13 //2033-3-5 13H  癸年 月干支:甲寅
	//year, month, day, hour = 2033, 3, 5, 14 //2033-3-5 14H  癸年 月干支:乙卯

	//year, month, day, hour = 2033, 12, 7, 2 //2033-12-7 2H  癸年 月干支:癸亥
	//year, month, day, hour = 2033, 12, 7, 3 //2033-12-7 3H  癸年 月干支:甲子

	//year, month, day, hour = 2034, 1, 5, 14 //2034-1-5 14H  癸年 月干支:甲子
	//year, month, day, hour = 2034, 1, 5, 15 //2034-1-5 15H  癸年 月干支:乙丑

	//year, month, day, hour = 2034, 2, 4, 1 //2034-2-4 1H  癸年 月干支:乙丑
	//year, month, day, hour = 2034, 2, 4, 2 //2034-2-4 2H  甲年 月干支:丙寅

	ygz, mgz := TMonthGanZhi(year, month, day, hour)
	fmt.Printf(" %d %d %d %dH %s年 月干支:%s\n", year, month, day, hour, ygz, mgz)
}
func TestTYearGanZhi(t *testing.T) {
	gzo := NewTGanZhi(2033, 12, 22, 3)
	lunars, moons := gzo.GetLunar()
	fmt.Println(lunars, moons) //阴历: 闰冬月初一 月相: 0.001879
}
